test_result/fio-3.28-4R5J0001-rw-1G-qd4-num1-4K-3000-WT.txt
fio: Any use of blockalign= turns off randommap
fio-3.28-4R5J0001-randwrite-1G-4-1-4K: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
fio-3.28
Starting 1 process
{
  "fio version" : "fio-3.28",
  "timestamp" : 1750685732,
  "timestamp_ms" : 1750685732284,
  "time" : "Mon Jun 23 21:35:32 2025",
  "global options" : {
    "ba" : "192K"
  },
  "jobs" : [
    {
      "jobname" : "fio-3.28-4R5J0001-randwrite-1G-4-1-4K",
      "groupid" : 0,
      "error" : 0,
      "eta" : 2147483647,
      "elapsed" : 2,
      "job options" : {
        "name" : "fio-3.28-4R5J0001-randwrite-1G-4-1-4K",
        "filename" : "/dev/sda",
        "rw" : "randwrite",
        "bs" : "4K",
        "size" : "1G",
        "runtime" : "3000",
        "ioengine" : "libaio",
        "direct" : "1",
        "iodepth" : "4",
        "numjobs" : "1",
        "group_reporting" : "1",
        "ramp_time" : "0"
      },
      "read" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "write" : {
        "io_bytes" : 1073741824,
        "io_kbytes" : 1048576,
        "bw_bytes" : 631984593,
        "bw" : 617172,
        "iops" : 154293.113596,
        "runtime" : 1699,
        "total_ios" : 262144,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 1941,
          "max" : 28182,
          "mean" : 2459.068512,
          "stddev" : 655.500332,
          "N" : 262144
        },
        "clat_ns" : {
          "min" : 11390,
          "max" : 146955,
          "mean" : 22945.723518,
          "stddev" : 2976.505002,
          "N" : 262144,
          "percentile" : {
            "1.000000" : 16768,
            "5.000000" : 18304,
            "10.000000" : 18816,
            "20.000000" : 19840,
            "30.000000" : 21120,
            "40.000000" : 22400,
            "50.000000" : 23936,
            "60.000000" : 24448,
            "70.000000" : 24704,
            "80.000000" : 24960,
            "90.000000" : 25984,
            "95.000000" : 27520,
            "99.000000" : 29568,
            "99.500000" : 29824,
            "99.900000" : 31360,
            "99.950000" : 32128,
            "99.990000" : 36608
          },
          "bins" : {
            "11328" : 1,
            "11456" : 1,
            "11584" : 1,
            "11712" : 2,
            "12096" : 1,
            "12864" : 1,
            "12992" : 2,
            "13120" : 3,
            "13248" : 1,
            "13632" : 1,
            "13760" : 1,
            "14016" : 1,
            "14272" : 2,
            "14400" : 2,
            "14528" : 44,
            "14656" : 188,
            "14784" : 312,
            "14912" : 102,
            "15040" : 30,
            "15168" : 16,
            "15296" : 9,
            "15424" : 18,
            "15552" : 10,
            "15680" : 4,
            "15808" : 24,
            "15936" : 108,
            "16064" : 169,
            "16192" : 306,
            "16320" : 286,
            "16512" : 595,
            "16768" : 1047,
            "17024" : 1916,
            "17280" : 1435,
            "17536" : 1247,
            "17792" : 1654,
            "18048" : 2267,
            "18304" : 4127,
            "18560" : 9394,
            "18816" : 4087,
            "19072" : 3243,
            "19328" : 7450,
            "19584" : 5930,
            "19840" : 9088,
            "20096" : 5596,
            "20352" : 1862,
            "20608" : 2561,
            "20864" : 12234,
            "21120" : 9653,
            "21376" : 2397,
            "21632" : 2121,
            "21888" : 2746,
            "22144" : 6525,
            "22400" : 8432,
            "22656" : 7704,
            "22912" : 2762,
            "23168" : 1046,
            "23424" : 3843,
            "23680" : 5373,
            "23936" : 7413,
            "24192" : 9437,
            "24448" : 22687,
            "24704" : 25195,
            "24960" : 16669,
            "25216" : 13788,
            "25472" : 6483,
            "25728" : 3588,
            "25984" : 2549,
            "26240" : 1751,
            "26496" : 1356,
            "26752" : 1935,
            "27008" : 3025,
            "27264" : 2898,
            "27520" : 1595,
            "27776" : 1197,
            "28032" : 1305,
            "28288" : 1463,
            "28544" : 1096,
            "28800" : 908,
            "29056" : 986,
            "29312" : 1695,
            "29568" : 1463,
            "29824" : 713,
            "30080" : 232,
            "30336" : 155,
            "30592" : 103,
            "30848" : 68,
            "31104" : 74,
            "31360" : 74,
            "31616" : 68,
            "31872" : 56,
            "32128" : 38,
            "32384" : 9,
            "32640" : 8,
            "33024" : 21,
            "33536" : 7,
            "34048" : 8,
            "34560" : 6,
            "35072" : 6,
            "35584" : 7,
            "36096" : 1,
            "36608" : 1,
            "37632" : 3,
            "38144" : 3,
            "39680" : 4,
            "40192" : 1,
            "40704" : 1,
            "45312" : 1,
            "45824" : 1,
            "49408" : 1,
            "54528" : 1,
            "56576" : 1,
            "57088" : 1,
            "72192" : 1,
            "80384" : 3,
            "140288" : 2,
            "146432" : 2
          }
        },
        "lat_ns" : {
          "min" : 16711,
          "max" : 149029,
          "mean" : 25533.911850,
          "stddev" : 2957.514666,
          "N" : 262144
        },
        "bw_min" : 616360,
        "bw_max" : 618480,
        "bw_agg" : 100.000000,
        "bw_mean" : 617253.333333,
        "bw_dev" : 1098.605176,
        "bw_samples" : 3,
        "iops_min" : 154090,
        "iops_max" : 154620,
        "iops_mean" : 154313.333333,
        "iops_stddev" : 274.651294,
        "iops_samples" : 3
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 1698,
      "usr_cpu" : 18.610130,
      "sys_cpu" : 51.295642,
      "ctx" : 90911,
      "majf" : 0,
      "minf" : 8,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 99.998856,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 21.472931,
        "50" : 78.522873,
        "100" : 0.010000,
        "250" : 0.010000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 4,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "sda",
      "read_ios" : 46,
      "write_ios" : 251630,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 4,
      "write_ticks" : 5284,
      "in_queue" : 5288,
      "util" : 94.797688
    }
  ]
}

fio-3.28-4R5J0001-randwrite-1G-4-1-4K: (groupid=0, jobs=1): err= 0: pid=79533: Mon Jun 23 21:35:32 2025
  write: IOPS=154k, BW=603MiB/s (632MB/s)(1024MiB/1699msec); 0 zone resets
    slat (nsec): min=1941, max=28182, avg=2459.07, stdev=655.50
    clat (usec): min=11, max=146, avg=22.95, stdev= 2.98
     lat (usec): min=16, max=149, avg=25.53, stdev= 2.96
    clat percentiles (nsec):
     |  1.00th=[16768],  5.00th=[18304], 10.00th=[18816], 20.00th=[19840],
     | 30.00th=[21120], 40.00th=[22400], 50.00th=[23936], 60.00th=[24448],
     | 70.00th=[24704], 80.00th=[24960], 90.00th=[25984], 95.00th=[27520],
     | 99.00th=[29568], 99.50th=[29824], 99.90th=[31360], 99.95th=[32128],
     | 99.99th=[36608]
   bw (  KiB/s): min=616360, max=618480, per=100.00%, avg=617253.33, stdev=1098.61, samples=3
   iops        : min=154090, max=154620, avg=154313.33, stdev=274.65, samples=3
  lat (usec)   : 20=21.47%, 50=78.52%, 100=0.01%, 250=0.01%
  cpu          : usr=18.61%, sys=51.30%, ctx=90911, majf=0, minf=8
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
  WRITE: bw=603MiB/s (632MB/s), 603MiB/s-603MiB/s (632MB/s-632MB/s), io=1024MiB (1074MB), run=1699-1699msec

Disk stats (read/write):
  sda: ios=46/251630, merge=0/0, ticks=4/5284, in_queue=5288, util=94.80%